Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: ``anim_type``: Describes how the screen is loaded (e.g., ``"move_right"``, ``"fade_in"``).
it_it: ``anim_type``: Descrive come viene caricata la schermata (ad esempio, ``"move_right"``, ``"fade_in"``).

source: ``anim`` animation
it_it: ``anim`` animazione

source: ``arch`` architectural changes
it_it: ``arch`` modifiche architetturali

source: ``as_file`` must be set to ``true`` to indicate that the font is treated as a file.
it_it: ``as_file`` deve essere impostato a ``true`` per indicare che il font viene trattato come un file.

source: ``attributes`` is an array of property name-value pairs, terminated by ``NULL, NULL``.
it_it: ``attributes`` è un array di coppie nome-valore di proprietà, terminato da ``NULL, NULL``.

source: ``axis`` can be :cpp:enumerator:`LV_CHART_AXIS_PRIMARY_Y` (left Y axis) or :cpp:enumerator:`LV_CHART_AXIS_SECONDARY_Y` (right Y axis).
it_it: ``axis`` può essere :cpp:enumerator:`LV_CHART_AXIS_PRIMARY_Y` (asse Y sinistro) o :cpp:enumerator:`LV_CHART_AXIS_SECONDARY_Y` (asse Y destro).

source: ``axis`` specifies which axis is used to scale its values, and may be one of the following:
it_it: ``axis`` specifica quale asse viene utilizzato per scalare i valori e può essere uno dei seguenti:

source: ``bg_color`` should be set directly on the label of the Text Area.
it_it: ``bg_color`` deve essere impostato direttamente sull'etichetta della Text Area.

source: ``binfont``: Similar to the built-in format, but the font is stored as a file, so it can be loaded at runtime too
it_it: ``binfont``: Simile al formato nativo, ma il font viene memorizzato come file, quindi può essere caricato anche in fase di esecuzione

source: ``buf1`` a buffer to which LVGL can render pixels
it_it: ``buf1``, un buffer in cui LVGL può eseguire il rendering dei pixel

source: ``buf2`` a second optional buffer (see below)
it_it: ``buf2``, un secondo buffer opzionale (vedere di seguito)

source: ``buf_size_in_bytes`` size of buffer(s) in bytes
it_it: ``buf_size_in_bytes``, dimensione del/i buffer in byte

source: ``button_id`` is a zero-based button index (0 = first button).
it_it: ``button_id`` è un indice del pulsante a base zero (0 = primo pulsante).

source: ``chore`` any minor formatting or style changes that would make the changelog noisy
it_it: ``chore`` qualsiasi modifica minore di formattazione o stile che renderebbe il changelog poco chiaro

source: ``class_p`` will affect the way the font manager interprets src.
it_it: ``class_p`` influenzerà il modo in cui il gestore dei font interpreta src.

source: ``column_align`` and ``row_align`` determine how to align the child Widget in its cell.
it_it: ``column_align`` e ``row_align`` determinano come allineare il Widget figlio nella sua cella.

source: ``column_span`` and ``row_span`` means how many tracks should be occupied from the start cell.
it_it: ``column_span`` e ``row_span`` indicano quante track devono essere occupate dalla cella iniziale.

source: ``connector_id`` specifies which display output (HDMI, eDP, DP, etc.) should be used.
it_it: ``connector_id`` specifica quale uscita video (HDMI, eDP, DP, ecc.) deve essere utilizzata.

source: ``const`` strings are safe to use with :cpp:func:`lv_label_set_text_static` since they are stored in ROM memory, which is always accessible.
it_it: Le stringhe ``const`` sono sicure da usare con :cpp:func:`lv_label_set_text_static` poiché sono memorizzate nella memoria ROM, che è sempre accessibile.

source: ``consts`` can be referenced with ``#``.
it_it: ``consts`` può essere referenziato con ``#``.

source: ``cortexa53``: Files for the Cortex-A53 (ARMv8-A) architecture.
it_it: ``cortexa53``: File per l'architettura Cortex-A53 (ARMv8-A).

source: ``cross_place`` determines how to distribute the items in their track on the cross axis.
it_it: ``cross_place`` determina come distribuire gli elementi nella loro track sull'asse trasversale.

source: ``current_path`` = [empty buffer]
it_it: ``current_path`` = [buffer vuoto]

source: ``custom``: Map custom C functions to XML, e.g. ``bind_state_is_eq``
it_it: ``custom``: Mappa funzioni C personalizzate in XML, ad esempio ``bind_state_is_eq``

source: ``data->state`` should also be set to either ``LV_INDEV_STATE_PRESSED`` or ``LV_INDEV_STATE_RELEASED``.
it_it: ``data->state`` deve essere impostato anche su ``LV_INDEV_STATE_PRESSED`` o ``LV_INDEV_STATE_RELEASED``.

source: ``data_p`` will be passed to the function when it's called.
it_it: ``data_p`` verrà passato alla funzione quando viene chiamata.

source: ``delay``: Delay before starting in milliseconds.
it_it: ``delay``: Ritardo prima dell'inizio in millisecondi.

source: ``delay``: Wait time before loading the screen in milliseconds.
it_it: ``delay``: Tempo di attesa prima del caricamento della schermata in millisecondi.

source: ``digit_count`` is the total number of digits to display.
it_it: ``digit_count`` è il numero totale di cifre da visualizzare.

source: ``dir`` can be ``LV_DIR_LEFT/RIGHT/TOP/BOTTOM/HOR/VER/ALL`` or OR-ed values to enable moving to the adjacent tiles in the given direction by swiping.
it_it: ``dir`` può essere ``LV_DIR_LEFT/RIGHT/TOP/BOTTOM/HOR/VER/ALL`` o valori combinati OR per consentire lo spostamento ai tile [riquadri] adiacenti nella direzione specificata tramite scorrimento.

source: ``docs`` anything related to documentation (including fixes, formatting, and new pages)
it_it: ``docs`` qualsiasi elemento relativo alla documentazione (inclusi fix, formattazione e nuove pagine)

source: ``dsc`` descriptor
it_it: ``dsc`` descrittore

source: ``dump obj -L 2``: Dump the object tree with a depth of 2.
it_it: ``dump obj -L 2``: Esegue il dump dell'albero degli oggetti con una profondità di 2.

source: ``dump obj -a 0x60700000dd10``: Dump the object tree starting from the specified address.
it_it: ``dump obj -a 0x60700000dd10``: Esegue il dump dell'albero degli oggetti a partire dall'indirizzo specificato.

source: ``dump obj``: Dump the object tree.
it_it: ``dump obj``: Esegue il dump dell'albero degli oggetti.

source: ``duration``: Duration of the animation in milliseconds.
it_it: ``duration``: Durata dell'animazione in millisecondi.

source: ``duration``: Length of the animation in milliseconds.
it_it: ``duration``: Durata dell'animazione in millisecondi.

source: ``early_apply``: If ``true``, the start value is applied immediately, even during the delay.
it_it: ``early_apply``: Se ``true``, il valore iniziale viene applicato immediatamente, anche durante il delay.

source: ``end``: End value (integer only).
it_it: ``end``: Valore finale (solo intero).

source: ``evaluate_cb``), which each Draw Unit sets (for itself) during its initialization.
it_it: ``evaluate_cb``), che ogni Draw Unit imposta (per sé stessa) durante la sua inizializzazione.

source: ``event1`` would be ``/dev/input/event1``.
it_it: ``event1`` sarebbe ``/dev/input/event1``.

source: ``example`` anything related to examples (including fixes and new examples)
it_it: ``example`` qualsiasi elemento relativo agli esempi (inclusi fix e nuovi esempi)

source: ``fallback`` can be chained, so it will try to solve until there is no ``fallback`` set.
it_it: ``fallback`` può essere concatenato, quindi tenterà di risolvere il problema finché non verrà più impostato alcun ``fallback``.

source: ``false``: A C file with raw file data is also generated.
it_it: ``false``: Viene generato anche un file C con dati raw.

source: ``false``: It generates a C file with the :cpp:expr:`lv_font_t` structs.
it_it: ``false``: Genera un file C con le strutture :cpp:expr:`lv_font_t`.

source: ``false``: stop at the min/max value; ``true``: jump to the other end.
it_it: ``false``: si ferma al valore min/max; ``true``: salta all'altro estremo.

source: ``feat`` new feature
it_it: ``feat`` nuova funzionalità

source: ``file`` folder contains all the patches that can be applied when building the recipe.
it_it: La cartella ``file`` contiene tutte le patch che possono essere applicate durante la compilazione della ricetta.

source: ``files`` in this case is a directory next to ``frogfs.yaml`` that has all the files you want to include in the blob.
it_it: ``files`` in questo caso è una directory accanto a ``frogfs.yaml`` che contiene tutti i file da includere nel blob.

source: ``fix`` bugfix in LVGL source code
it_it: ``fix`` correzione di bug nel codice sorgente LVGL

source: ``flex`` and ``flex_flow``
it_it: ``flex`` e ``flex_flow``

source: ``fmt_txt``: This is the built-in font engine that stores the fonts as a C array
it_it: ``fmt_txt``: Questo è il "font engine" nativo che memorizza i font come array C

source: ``freetype``: Well known font rendering library load and render TTF fonts at runtime.
it_it: ``freetype``: Nota libreria di rendering di font che carica e renderizza font TTF in fase di esecuzione.

source: ``genconfig``: Generates a C header from the config, following ``autoconf.h`` format.
it_it: ``genconfig``: Genera un header C dalla configurazione, seguendo il formato ``autoconf.h``.

source: ``get``: Access implicitly created elements.
it_it: ``get``: Accede agli elementi creati implicitamente.

source: ``git clone`` or copy LVGL into your project directory.
it_it: ``git clone`` o copiare LVGL nella directory del progetto.

source: ``git`` is used to download the ``lv_port_linux`` and ``lvgl`` repositories from Github.
it_it: ``git`` viene utilizzato per scaricare i repository ``lv_port_linux`` e ``lvgl`` da Github.

source: ``globals.xml`` is a special XML file in which globally available
it_it: ``globals.xml`` è uno speciale file XML in cui sono disponibili

source: ``guiconfig`` (needs ``tkinter``): Opens a graphical interface to modify the configuration values.
it_it: ``guiconfig`` (richiede ``tkinter``): Apre un'interfaccia grafica per modificare i valori di configurazione.

source: ``header.cf`` will be :cpp:enumerator:`LV_COLOR_FORMAT_RAW`, :cpp:enumerator:`LV_COLOR_FORMAT_RAW_ALPHA` accordingly.
it_it: ``header.cf`` sarà :cpp:enumerator:`LV_COLOR_FORMAT_RAW`, :cpp:enumerator:`LV_COLOR_FORMAT_RAW_ALPHA` di conseguenza.

source: ``height`` Font size.
it_it: ``height`` Dimensione del font.

source: ``https://github.com/ORG/REPO/tree/BRANCH/FOLDER``: open a folder of the repository from a given branch
it_it: ``https://github.com/ORG/REPO/tree/BRANCH/FOLDER``: apre una cartella del repository da un branch specifico

source: ``https://github.com/ORG/REPO/tree/BRANCH``: open the root of the repository from a given branch
it_it: ``https://github.com/ORG/REPO/tree/BRANCH``: apre la root del repository da un branch specifico

source: ``https://github.com/ORG/REPO``: open the root of the repository on the default branch
it_it: ``https://github.com/ORG/REPO``: apre la root del repository sul branch di default

source: ``indev`` input device
it_it: ``indev`` device di input

source: ``info draw_unit``: Display all current drawing unit information.
it_it: ``info draw_unit``: Visualizza tutte le informazioni sull'unità di disegno corrente.

source: ``info style address_of_obj``: Show the object's style.
it_it: ``info style address_of_obj``: Mostra lo stile dell'oggetto.

source: ``info style``: Show the object's style.
it_it: ``info style``: Mostra lo stile dell'oggetto.

source: ``label_dsc.color`` corresponds to the ``text_color`` style property.
it_it: ``label_dsc.color`` corrisponde alla proprietà di stile ``text_color``.

source: ``linux-base_dbg``: Linux Debug build.
it_it: ``linux-base_dbg``: Build di Debug per Linux.

source: ``linux-base_rel``: Linux Release build.
it_it: ``linux-base_rel``: Build di Release per Linux.

source: ``linux-base``: A Linux configuration, using Ninja and GCC.
it_it: ``linux-base``: Una configurazione Linux, che utilizza Ninja e GCC.

source: ``linux-kconfig``: A Linux configuration, using Ninja and GCC.
it_it: ``linux-kconfig``: Una configurazione Linux, che utilizza Ninja e GCC.

source: ``lv_<widget_type>_...()`` functions for type-specific properties, e.g. :cpp:expr:`lv_label_set_text()`, :cpp:expr:`lv_slider_set_value()`, etc.
it_it: Funzioni ``lv_<widget_type>_...()`` per proprietà specifiche del tipo, ad esempio :cpp:expr:`lv_label_set_text()`, :cpp:expr:`lv_slider_set_value()`, ecc.

source: ``lv_bmp.c`` has an example of ``decoder_get_area()``.
it_it: ``lv_bmp.c`` ha un esempio di ``decoder_get_area()``.

source: ``lv_button`` named ``"second_button"``: "second_button"
it_it: ``lv_button`` chiamato ``"second_button"``: "second_button"

source: ``lv_button`` named ``lv_button_#``: "lv_button_2"
it_it: ``lv_button`` chiamato ``lv_button_#``: "lv_button_2"

source: ``lv_button`` named ``mybtn_#``: "mybtn_0"
it_it: ``lv_button`` chiamato ``mybtn_#``: "mybtn_0"

source: ``lv_button`` named ``mybtn_#``: "mybtn_1"
it_it: ``lv_button`` chiamato ``mybtn_#``: "mybtn_1"

source: ``lv_button`` named ``mybtn_#``: "mybtn_2"
it_it: ``lv_button`` chiamato ``mybtn_#``: "mybtn_2"

source: ``lv_button`` named ``mybtn_#``: "mybtn_3"
it_it: ``lv_button`` chiamato ``mybtn_#``: "mybtn_3"

source: ``lv_button`` with no name: "lv_button_0"
it_it: ``lv_button`` senza nome: "lv_button_0"

source: ``lv_button`` with no name: "lv_button_1"
it_it: ``lv_button`` senza nome: "lv_button_1"

source: ``lv_button`` with no name: "lv_button_2"
it_it: ``lv_button`` senza nome: "lv_button_2"

source: ``lv_buttonmatrix``: Orders buttons from right to left
it_it: ``lv_buttonmatrix``: Ordina i pulsanti da destra a sinistra

source: ``lv_checkbox``: Shows the box on the right
it_it: ``lv_checkbox``: Mostra la casella a destra

source: ``lv_conf.h`` Symbol to Set
it_it: ``lv_conf.h`` Simbolo da Impostare

source: ``lv_conf.inc`` is an include file, usually containing common configuration settings for LVGL that can be shared between multiple recipes.
it_it: ``lv_conf.inc`` è un file include, che di solito contiene impostazioni di configurazione comuni per LVGL che possono essere condivise tra più ricette.

source: ``lv_dpx`` can be used anywhere a pixel value is needed (``x``, ``y``, ``width``, ``height``, ``radius``, ``padding``, etc.).
it_it: ``lv_dpx`` può essere utilizzato ovunque sia necessario un valore in pixel (``x``, ``y``, ``width``, ``height``, ``radius``, ``padding``, ecc.).

source: ``lv_draw_layer(layer, &dsc, area)`` initializes the blending of a layer back to its parent layer.
it_it: ``lv_draw_layer(layer, &dsc, area)`` inizializza la fusione di un layer con il suo layer padre.

source: ``lv_dropdown``: Aligns options to the right
it_it: ``lv_dropdown``: Allinea le opzioni a destra

source: ``lv_example_lottie_approve.c`` contains an example animation.
it_it: ``lv_example_lottie_approve.c`` contiene un'animazione di esempio.

source: ``lv_example_rlottie_approve.c`` contains an example animation in raw format.
it_it: ``lv_example_rlottie_approve.c`` contiene un'animazione di esempio in formato raw.

source: ``lv_file_explorer`` only provides the file browsing and events caused by user activity (e.g. clicking a file), but does not provide the actual file operations.
it_it: ``lv_file_explorer`` fornisce solo la navigazione dei file e gli eventi causati dall'attività dell'utente (ad esempio, il clic su un file), ma non fornisce le operazioni effettive sui file.

source: ``lv_file_explorer`` passes the full path and name of file that was clicked to the event callback functions.
it_it: ``lv_file_explorer`` passa il path completo e il nome del file su cui è stato fatto clic alle funzioni di callback dell'evento.

source: ``lv_file_explorer`` provides a UI enabling the end user to browse the contents of a file system.
it_it: ``lv_file_explorer`` fornisce un'interfaccia utente che consente all'utente finale di esplorare il contenuto di un file system.

source: ``lv_file_explorer`` uses the :ref:`lv_table` Widget for the "Browsing Area", and the :ref:`lv_list` Widget for the "Quick-Access" panel when it is enabled.
it_it: ``lv_file_explorer`` utilizza il Widget :ref:`lv_table` per la "Browsing Area" [Area di navigazione] e il Widget :ref:`lv_list` per il pannello "Quick-Access" quando è abilitato.

source: ``lv_fs_read`` :sub:`(behavior when cache is enabled)`
it_it: ``lv_fs_read`` :sub:`(comportamento quando la cache è abilitata)`

source: ``lv_fs_seek`` :sub:`(behavior when cache is enabled)`
it_it: ``lv_fs_seek`` :sub:`(comportamento quando la cache è abilitata)`

source: ``lv_fs_tell`` :sub:`(behavior when cache is enabled)`
it_it: ``lv_fs_tell`` :sub:`(comportamento quando la cache è abilitata)`

source: ``lv_fs_write`` :sub:`(behavior when cache is enabled)`
it_it: ``lv_fs_write`` :sub:`(comportamento quando la cache è abilitata)`

source: ``lv_label`` named ``"title"``: "title"
it_it: ``lv_label`` chiamato ``"title"``: "title"

source: ``lv_label`` with no name: "lv_label_0"
it_it: ``lv_label`` senza nome: "lv_label_0"

source: ``lv_label`` with no name: "lv_label_1" (It's the third label, but custom-named Widgets are not counted)
it_it: ``lv_label`` senza nome: "lv_label_1" (È la terza etichetta, ma i Widget con nomi personalizzati non vengono conteggiati)

source: ``lv_list``: Shows icons on the right
it_it: ``lv_list``: Mostra le icone a destra

source: ``lv_obj_...()`` functions for common properties, e.g. :cpp:expr:`lv_obj_set_width()`, :cpp:expr:`lv_obj_add_style()`, etc.
it_it: Funzioni ``lv_obj_...()`` per proprietà comuni, ad esempio :cpp:expr:`lv_obj_set_width()`, :cpp:expr:`lv_obj_add_style()`, ecc.

source: ``lv_obj_find_by_id(widget, id)`` is deprecated.
it_it: ``lv_obj_find_by_id(widget, id)`` è deprecato.

source: ``lv_obj_init_draw_rect_dsc(obj, part, &dsc);`` initializes a draw descriptor from a Widget, and ``lv_draw_rect(layer, &dsc, area)`` draws the rectangle in a specified area.
it_it: ``lv_obj_init_draw_rect_dsc(obj, part, &dsc);`` inizializza un descrittore di disegno da un Widget e ``lv_draw_rect(layer, &dsc, area)`` disegna il rettangolo in un'area specificata.

source: ``lv_obj_scroll_by(widget, x, y, LV_ANIM_ON/OFF)`` scroll by ``x`` and ``y`` values
it_it: ``lv_obj_scroll_by(widget, x, y, LV_ANIM_ON/OFF)`` scorre in base ai valori ``x`` e ``y``

source: ``lv_obj_scroll_to(widget, x, y, LV_ANIM_ON/OFF)`` scroll to bring the given coordinate to the top left corner
it_it: ``lv_obj_scroll_to(widget, x, y, LV_ANIM_ON/OFF)`` scorre per portare la coordinata specificata nell'angolo in alto a sinistra

source: ``lv_obj_scroll_to_x(widget, x, LV_ANIM_ON/OFF)`` scroll to bring the given coordinate to the left side
it_it: ``lv_obj_scroll_to_x(widget, x, LV_ANIM_ON/OFF)`` scorre per portare la coordinata specificata sul lato sinistro

source: ``lv_obj_scroll_to_y(widget, y, LV_ANIM_ON/OFF)`` scroll to bring the given coordinate to the top side
it_it: ``lv_obj_scroll_to_y(widget, y, LV_ANIM_ON/OFF)`` scorre per portare la coordinata specificata sul lato superiore

source: ``lv_obj_t * main_screen_create(void)`` from ``main_screen.xml``
it_it: ``lv_obj_t * main_screen_create(void)`` da ``main_screen.xml``

source: ``lv_obj_t * my_button_create(lv_obj_t * parent, const char * button_text)`` from ``my_button.xml``
it_it: ``lv_obj_t * my_button_create(lv_obj_t * parent, const char * button_text)`` da ``my_button.xml``

source: ``lv_obj`` container named ``"buttons"``:
it_it: Contenitore ``lv_obj`` chiamato ``"buttons"``:

source: ``lv_obj`` container named ``"header"``: "header"
it_it: Contenitore ``lv_obj`` chiamato ``"header"``: "header"

source: ``lv_span_t * span = lv_spangroup_get_child(spangroup, -1)`` will return the last (or most recent) child.
it_it: ``lv_span_t * span = lv_spangroup_get_child(spangroup, -1)`` restituirà l'ultimo elemento figlio (o il più recente).

source: ``lv_tabview``: Displays tabs from right to left
it_it: ``lv_tabview``: Visualizza le schede da destra a sinistra

source: ``lv_test_screenshot_result_t lv_test_screenshot_compare(const char * fn_ref)`` is a useful function to compare the content of the emulated display with reference PNG images.
it_it: ``lv_test_screenshot_result_t lv_test_screenshot_compare(const char * fn_ref)`` è una funzione utile per confrontare il contenuto del display emulato con le immagini PNG di riferimento.

source: ``lv_translation``: A simpler yet more flexible solution that allows adding translations statically or dynamically.
it_it: ``lv_translation``: Una soluzione più semplice ma flessibile che consente di aggiungere traduzioni staticamente o dinamicamente.

source: ``lvgl-demo-fb_9.1.0.bb`` is a recipe to build an application using lvgl.
it_it: ``lvgl-demo-fb_9.1.0.bb`` è una ricetta per compilare un'applicazione utilizzando lvgl.

source: ``lvgl/scripts/filetohex.py`` can be used to convert a Lottie file a hex array.
it_it: ``lvgl/scripts/filetohex.py`` può essere utilizzato per convertire un file Lottie in un array esadecimale.

source: ``lvgl/scripts/filetohex.py`` can be used to convert a Lottie file to a hex array.
it_it: ``lvgl/scripts/filetohex.py`` può essere utilizzato per convertire un file Lottie in un array esadecimale.

source: ``lvgl_9.1.0.bb`` is the recipe to build lvgl library.
it_it: ``lvgl_9.1.0.bb`` è la ricetta per compilare la libreria lvgl.

source: ``main_place`` determines how to distribute the items in their track on the main axis.
it_it: ``main_place`` determina come distribuire gli elementi nella loro track sull'asse principale.

source: ``manifests``: Track files installed in the sysroot by package.
it_it: ``manifests``: File "track" installati nella sysroot per pacchetto.

source: ``max_height`` can be used to limit the height of the list.
it_it: ``max_height`` può essere utilizzato per limitare l'altezza della lista.

source: ``menuconfig``: Opens a console menu interface to modify the configuration values.
it_it: ``menuconfig``: Apre un'interfaccia a menù della console per modificare i valori di configurazione.

source: ``min/max`` minimum/maximum
it_it: ``min/max`` minimo/massimo

source: ``mode`` can be :cpp:enumerator:`LV_FS_MODE_WR` or :cpp:enumerator:`LV_FS_MODE_RD` to open for writes or reads.
it_it: ``mode`` può essere :cpp:enumerator:`LV_FS_MODE_WR` o :cpp:enumerator:`LV_FS_MODE_RD` per aprire in scrittura o lettura.

source: ``month`` needs to be in 1..12 range and ``day`` in 1..31 range.
it_it: ``month`` deve essere compreso tra 1 e 12 e ``day`` tra 1 e 31.

source: ``my_input_read`` is a function pointer that will be called periodically to report the current state of the input device to LVGL.
it_it: ``my_input_read`` è un puntatore a funzione che verrà chiamato periodicamente per segnalare lo stato corrente del dispositivo di input a LVGL.

source: ``my_ltdc_framebuffer_address`` is the framebuffer configured for use by LTDC.
it_it: ``my_ltdc_framebuffer_address`` è il framebuffer configurato per l'utilizzo da parte di LTDC.

source: ``my_ltdc_layer_index`` is the layer index of the LTDC layer to create the display for.
it_it: ``my_ltdc_layer_index`` è l'indice del layer LTDC per cui creare il display.

source: ``optional_other_full_size_buffer`` can be another buffer which is the same size as the default framebuffer for double-buffered mode, or ``NULL`` otherwise.
it_it: ``optional_other_full_size_buffer`` può essere un altro buffer delle stesse dimensioni del framebuffer di default per la modalità a doppio buffer, oppure ``NULL`` in caso contrario.

source: ``pad_column`` adjusts spacing between tickbox and label
it_it: ``pad_column`` regola la spaziatura tra la tickbox e l'etichetta.

source: ``pad_column`` sets the space between columns in the same data series.
it_it: ``pad_column`` imposta lo spazio tra le colonne nella stessa serie di dati.
